<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"907dce567cad1e5dac9e1b3e7f64e2276eb8257f3df1408ed4076784524d8329","plan_job_ref":"Job Create terraform plan #14 at https://github.com/coforma/co-boomi-atom-fargate/actions/runs/6544103873","plan_hash":"f1d81d823cb60e3e051b9d9d2d70ca9074b44c40cc96794c8de4e4fb6d4a42bb","plan_text_format":"text","version":"1.36.2"} -->
Terraform plan in __.__
<details>
<summary>Plan: 2 to add, 2 to change, 3 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.service will be updated in-place
  ~ resource "aws_ecs_service" "service" {
        id                                 = "arn:aws:ecs:us-east-1:950012193416:service/co-boomi-atom-cluster/co-boomi-atom-service"
        name                               = "co-boomi-atom-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-east-1:950012193416:task-definition/co-boomi-atom:7" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "task_definition" {
      ~ arn                      = "arn:aws:ecs:us-east-1:950012193416:task-definition/co-boomi-atom:7" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:950012193416:task-definition/co-boomi-atom" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - cpu              = 0
                  ~ image            = "boomi/atom:4.3.5" -> "boomi/atom:4.3.4"
                  - mountPoints      = []
                    name             = "co-boomi-atom-ct"
                  ~ portMappings     = [
                      ~ {
                          - hostPort      = 9090
                          - protocol      = "tcp"
                            # (1 unchanged attribute hidden)
                        },
                    ]
                  - volumesFrom      = []
                    # (4 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "*************" -> (known after apply)
      ~ revision                 = 7 -> (known after apply)
      - tags                     = {} -> null
        # (9 unchanged attributes hidden)
    }

  # module.lambda.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/16eeffaa411a670a912776f50e880ac1f7ece50754323efa86042684485f4fdf.zip" -> "./lambda/rotate_install_token.zip"
        id                             = "co-boomi-atom-secret-install-lambda"
      ~ last_modified                  = "2023-10-17T05:27:59.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:950012193416:function:co-boomi-atom-secret-install-lambda:8" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:950012193416:function:co-boomi-atom-secret-install-lambda:8/invocations" -> (known after apply)
      ~ source_code_hash               = "nwzztY49it+xwtHLlsCCuq07G1NhKmdBuSGwGS40F6c=" -> "UPbPvx9KsTCylc2BMnyeKAurrVithZue8t+4B5GlRhk="
        tags                           = {}
      ~ version                        = "8" -> (known after apply)
        # (17 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_permission.current_version_triggers["secrets"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "*******" -> (known after apply)
      ~ qualifier           = "8" # forces replacement -> (known after apply) # forces replacement
      + statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.lambda.null_resource.archive[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "null_resource" "archive" {
      - id       = "4972842440335601011" -> null
      - triggers = {
          - "filename"  = "builds/16eeffaa411a670a912776f50e880ac1f7ece50754323efa86042684485f4fdf.zip"
          - "timestamp" = "1697478871006104000"
        } -> null
    }

Plan: 2 to add, 2 to change, 3 to destroy.
```
</details>

:memo: Plan generated in [Create terraform plan #14](https://github.com/coforma/co-boomi-atom-fargate/actions/runs/6544103873)